Revit 2027 API
ColorOptions.SelectionSemitransparent Property
 Indicates whether or not selections will be shown in a semi-transparent manner in current canvas theme.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SelectionSemitransparent { get; set; }
Public Property SelectionSemitransparent As Boolean
	Get
	Set
public:
property bool SelectionSemitransparent {
	bool get ();
	void set (bool value);
}
member SelectionSemitransparent : bool with get, set
Property Value
Boolean
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace